{
    "projects": [
        {
            "id": 1,
            "sitename": "Jacob's Engineering",
            "screenshot": "./images/smu_screenshot.png",
            "description": "Since October 2018, I have been working as the in house web developer at South Moon Under in Annapolis, MD. As the web developer, I am a member of an Ecom/Marketing team that includes very talented designers, SEO Specialists, and digital strategists who work to make the site what it is. My roles and responsibilities on the team include, but are not limited to the following:",
            "applink": "https://www.dcita.edu/"
        },
        {
            "id": 2,
            "sitename": "South Moon Under",
            "screenshot": "/images/smu_screenshot.png",
            "description": "From October 2018 through February 2020, I worked as the in house web developer at South Moon Under in Annapolis, MD. As the web developer, I was a member of an Ecomerce/Marketing team that includes very talented designers, SEO Specialists, and digital strategists. My roles and responsibilities on the team include, but are not limited to the following:",
            "applink": "https://www.dcita.edu/"
        }
    ],
    "about_me": [
        {
            "text": "Hey there! My name is Jesse Shaw. I am a Full Stack Developer currently working on a Learning Management System application at Jacob's Engineering. I enjoy coding because I love to create things. I enjoy building things from scratch and seeing them come to life. I am always interested in meeting and learning from fellow developers and creatives who have similar mindsets. I love working with people who are not afraid to challenge each other and make the world a better place."
        }
    ],
    "resume": [
        {
            "company": "Jacobs",
            "title": "Senior Web Developer",
            "start_date": "February 2020",
            "bullet_points": [
                "Worked on project UX/UI team to develop, test, and troubleshoot new features for a Learning Management System application built on a Ruby on Rails (Rails) framework. Assisted in the development of features within all elements of application built on a Model, View, and Controller framework. Experience from Rails 6 up to 7.1.3.",
                "Worked on a team of four in early-stage development of a Virtual Training Environment (VTE) application. This app was built on Rails 7 and utilizes a PostgreSQL database. Features of this application apply gems such as turbo, simpleform, and fontawesome. Docker is used for development and containerization of various components of the application.",
                "Improved and maintained legacy code and assets; troubleshoot bugs within a code base for an application built with Rails 6.",
                "Integrated a Drupal Content Management System into a Rails 6 application.",
                "Experience writing Data Migration code for Rails application.",
                "Experience writing tests using tools such as Rspec."
            ],
            "image": "/images/jacobs.svg"
        },
        {
            "company": "South Moon Under",
            "title": "Web Developer",
            "start_date": "October 2018",
            "end_date": "January 2020",
            "bullet_points": [
                "Built, managed, and maintained front end site features and integrations using HTML, CSS, JavaScript, and jQuery coding best practices within the Salesforce Commerce Cloud (SFCC) platform.",
                "Provided consultation to creative/design team with guidance on UX and Mobile design best practices to implement within site content updates.",
                "Developed cross-browser, cross-device compatible pages adhering to industry best practices.",
                "Updates to back-end site features built on the SFCC Pipeline Architecture. These features include product feed jobs that built XML catalog files with demandware script files as well as payment functionality.",
                "Developed A/B tests using Monetate platform. Built and tested features that have led to a 10 - 15% increase in Conversion Rate and a 15 - 20% increase in revenue generated per session.",
                "Implemented and researched Search Engine Optimization (SEO) opportunities for the brand. These opportunities included setting up structured data, tagging updates, and updating template files to serve needs of E-Commerce team to add appropriate content on the site within the SFCC Content Management System.",
                "Updated and managed site integrations with Monetate, Bronto, Channel Advisor, Facebook, Google Analytics."

            ],
            "image": "/images/smu_logo.png"
        },
        {
            "company": "Anne Arundel County Public Schools",
            "title": "Instructor",
            "start_date": "January 2017",
            "end_date": "October 2018",
            "bullet_points": [
                "Supervised students in a variety of school-related settings and activities.",
                "Monitored and evaluated student performance following Anne Arundel County procedures and practices."
            ],
            "image": "/images/AACPS.jpg"
        },           
        {
            "company": "Optimal Solutions Group",
            "title": "Reasearch Analyst/Project Manager",
            "start_date": "September 2013",
            "end_date": "December 2016",
            "bullet_points": [
                "Provided oversight for the timely submission of deliverables, moderated client meetings, and ensured projects remain within budget. Coordinated meetings with stakeholders.",
                "Assisted with creation and launch of the NWBC GROW Her Business Site built with WordPress. The site was featured in Fortune Magazine in June 2016. (See Link Below)",
                "Assisted senior researchers in the design, development, and deployment of surveys using Survey Monkey and the MAX Survey tool. These surveys supported research for Women’s Business Centers, as well as Regional Innovation Cluster (RIC) and ScaleUp Initiative and provided input to project findings."
            ],
            "image": "/images/optimal_square_logo.webp"
        }
    ]
}
