{
    "projects": [
        {
            "id": 1,
            "sitename": "Jacob's Engineering",
            "screenshot": "./images/smu_screenshot.png",
            "description": "Since October 2018, I have been working as the in house web developer at South Moon Under in Annapolis, MD. As the web developer, I am a member of an Ecom/Marketing team that includes very talented designers, SEO Specialists, and digital strategists who work to make the site what it is. My roles and responsibilities on the team include, but are not limited to the following:",
            "applink": "https://www.dcita.edu/"
        },
        {
            "id": 2,
            "sitename": "South Moon Under",
            "screenshot": "/images/smu_screenshot.png",
            "description": "From October 2018 through February 2020, I worked as the in house web developer at South Moon Under in Annapolis, MD. As the web developer, I was a member of an Ecomerce/Marketing team that includes very talented designers, SEO Specialists, and digital strategists. My roles and responsibilities on the team include, but are not limited to the following:",
            "applink": "https://www.dcita.edu/"
        }
    ],
    "projects_page": [
      
      {
        "paragraph": "My time is currently being taken up by my Full Time job at Jacobs. But I do wanna make sure I am putting in extra time to keep up n new tools and work on some of my own projects to stay sharp."
      },
      {
        "paragraph": "One passion project I am working on right now is a music rating application built using React and Flask. The Git Repository for that project can be found"
      },
      {
        "paragraph": "If you would like to keep up with all of the other work I am doing outside of my work at Jacob's, please check out my"
      }
    ],
    "about_me": [
        {
            "text": "Hey there! My name is Jesse Shaw. I am a Full Stack Developer currently working on a Learning Management System application at Jacob's Engineering. I enjoy coding because I love to create thing"
        }
    ],
    "resume": [
        {
            "company": "Amentum",
            "title": "Senior Web Developer (formerly Jacobs)",
            "start_date": "February 2020",
            "bullet_points": [
              "Collaborates with UX/UI team to create web-based applications for the U.S. Department of Defense, United States Air Force.",
              "Develops, tests, and troubleshoots new features for a Learning Management System (LMS) application built on a Ruby on Rails (Rails) framework.",
              "Developed features within all elements of the LMS application built on a Model, View, and Controller framework.",
              "Developed a Virtual Training Environment application on Rails 7 that uses a PostgreSQL database and turbo and stimulus gems.",
              "Built, managed, and maintained front end and back-end (full-stack) site features using coding best practices.",
              "Improved and maintained legacy code and assets and troubleshoot bugs within a code base for an application built with Rails 6.",
              "Integrated a Drupal Content Management System into a Rails 6 application.",
              "Writes Data Migration code for Rails application.",
              "Writes integrations tests using Rspec, pytest, and Rails built in testing to ensure functionality prior to deployment.",
              "Attends and collaborates with UX/UI team members during daily standup meetings, Sprint reviews, and Sprint Retrospectives."
              
            ],
            "image": "/images/jacobs.svg"
        },
        {
            "company": "South Moon Under",
            "title": "Web Developer",
            "start_date": "October 2018",
            "end_date": "January 2020",
            "bullet_points": [
              "Built, managed, and maintained front end site features and integrations using HTML, CSS, JavaScript, and jQuery coding best practices within Salesforce Demandware Business manager.",
              "Provided direction and guidance to creative/design team on UX and Mobile design best practices to implement within site content updates.",
              "Developed cross-browser, cross-device compatible pages adhering to industry best practices.",
              "Updated the back-end site features built on the Salesforce Commerce Cloud Pipeline Architecture, which included product feed jobs that built XML catalog files with demandware script files as well as payment functionality.",
              "Developed A/B tests using Monetate platform. Built and tested features that led to a 10 - 15% increase in conversion rate and a 15 - 20% increase in revenue generated per session.",
              "Implemented Search Engine Optimization opportunities for the brand, which included setting up structured data, tagging updates, and updating template files to serve needs of E-Commerce team to add appropriate content to the site within the Content Management System.",
              "Updated and managed site integrations with Monetate, Bronto, Channel Advisor, Facebook, Google Analytics."
            ],
            "image": "/images/smu_logo.png"
        },
        {
            "company": "Anne Arundel County Public Schools",
            "title": "Instructor",
            "start_date": "January 2017",
            "end_date": "October 2018",
            "bullet_points": [
              "Taught math according to lesson plan and curriculum requirements.",
              "Monitored and evaluated student performance following Anne Arundel County procedures and practices.",
              "Supervised students in a variety of school-related settings and activities."
            ],
            "image": "/images/AACPS.jpg"
        },           
        {
            "company": "Optimal Solutions Group",
            "title": "Reasearch Analyst/Project Manager",
            "start_date": "September 2013",
            "end_date": "December 2016",
            "bullet_points": [
              "Managed project activities and budget for a contract with the U.S. Small Business Administration.",
              "Effectively controlled personnel, materials, and equipment to manage the project budget. Tracked monthly utilization against budget projections to manage burn rates.",
              "Identified project risks, assessed impact to the schedule and budget, and developed mitigation strategies.",
              "Managed the development and timely submission of key deliverables (e.g., project management plan, work breakdown structure, etc.).",
              "Coordinated and facilitated client meetings and working sessions with key stakeholders.",
              "Created and launched the National Women’s Business Council’s GROW Her Business website built with WordPress.",
              "Designed, developed, and deployed surveys using Survey Monkey and the MAX Survey tool. These surveys supported research for Women’s Business Centers, the Regional Innovation Cluster (RIC), and the ScaleUp Initiative and provided input to project findings."
            ],
            "image": "/images/optimal_square_logo.webp"
        }
    ],
    "about": "Hey there! My name is Jesse Shaw. I am a Full Stack Developer currently working on a Learning Management System application at Jacob's Engineering. I enjoy coding because I love to create things. I enjoy building things from scratch and seeing them come to life. I am always interested in meeting and learning from fellow developers and creatives who have similar mindsets. I love working with people who are not afraid to challenge each other and make the world a better place.",
    "featured_projects": [
        772715217
    ]
}
